Repository: akorzunin/vpn_bot
Catalog: locale/*/LC_MESSAGES/messages.po
Languages: ru

source: Please provide vpn config name
ru: Пожалуйста, укажите имя конфигурации VPN

source: created
ru: создан

source: Vpn config
ru: Файл конфигурации VPN

source: Config path
ru: Путь конфига

source: disabled
ru: деактивирован

source: enabled
ru: активирован

source: QR code for vpn config
ru: QR-код для конфигурации VPN

source: Running speed test...
ru: Запуск теста скорости подключения...

source: Please provide user name and amount
ru: Пожалуйста, укажите имя пользователя и сумму

source: Payment created
ru: Платеж создан

source: Payment not created
ru: Платеж не создан

source: Invoice created
ru: Счет-фактура создан

source: Invoice not created
ru: Счет-фактура не создан

source: Bot commands: /help - show this message /add_vpn_config - Add vpn config to user account /del_config - Delete vpn config from database and from server. /me - info about user /redeem_code - Redeem code /pay - create invoice /pay_info - get payment informaion /deactivate_subscription - Deactivate subscription for customer.
ru: Команды бота: /help - показать сообщение /add_vpn_config - добавить конфигурацию vpn в учетную запись пользователя /del_config - удалить vpn-конфиг из базы данных и с сервера. /me - информация о пользователе /redeem_code - код выкупа /pay - создать счет-фактуру /pay_info - получить информацию о платеже /deactivate_subscription - деактивировать подписку для клиента.

source: Bot commands: /help - show this message /add_vpn_config - Add vpn config to user account /del_config - Delete vpn config from database and from server. /me - info about user /redeem_code - Redeem code /pay - create invoice /pay_info - get payment informaion /activate_subscription - Activate subscription for customer. Payment will be accepted immediately
ru: Команды бота: /help - показать сообщение /add_vpn_config - добавить конфигурацию vpn в учетную запись пользователя /del_config - удалить vpn-конфиг из базы данных и с сервера. /me - информация о пользователе /redeem_code - код выкупа /pay - создать счет-фактуру /pay_info - получить информацию о платеже /activate_subscription - Активировать подписку для клиента. Оплата будет принята немедленно

source: Bot commands: /help - show this message /start - login
ru: Команды бота: /help - показать это сообщение /start - войти в систему

source: Login with username
ru: Вход с именем пользователя

source: Login with invitation code
ru: Вход с кодом приглашения

source: Cancel
ru: Отмена

source: You already have an account with username {user.user_name} You can use /help to see available commands
ru: У вас уже есть учетная запись с именем пользователя {user.user_name} Вы можете использовать /help для просмотра доступных команд

source: Select a method to login. If you don't use vpn yet, please use username method
ru: Выберите метод для входа в систему. Если вы еще не использовали vpn, пожалуйста, используйте вход по имени пользователя

source: Enter your username
ru: Введите имя пользователя

source: Enter your code
ru: Введите ваш промокод

source: User {user.user_name} created U can use ... commands
ru: Пользователь {user.user_name} создан, вы можете использовать ... команды

source: User {user.user_name} already exists
ru: Пользователь {user.user_name} уже существует

source: User linked with code {code} U can use ... commands
ru: Пользователь связан с кодом {code} и может использовать ... команды

source: Login dialog ended
ru: Диалог входа в систему завершен

source: User data:
ru: Данные пользователя:

source: Enabled users:
ru: Активные пользователи:

source: Disabled users
ru: Деактивированные пользователи

source: Vpn config file
ru: Файл конфигурации Vpn

source: All user configs:
ru: Все пользовательские конфиги:

source: Speed test data:
ru: Данные тестирования скорости:

source: Invoice created:
ru: Счет-фактура создан:

source: To get payment info use /pay_info
ru: Чтобы получить информацию о платеже, используйте /pay_info

source: Payment notification: Balance: {user.balance} Next payment: {user.next_payment}
ru: Уведомление об оплате: Баланс: {user.balance} Следующий платеж: {user.next_payment}

source: Subscription canceled
ru: Подписка отменена

source: Reason: {reason}
ru: Причина: {reason}

source: FOR ADMIN: Incoming Payment notification id: {payment.id} User: {user.telegram_id} Amount: {payment.amount} Pay comment: {payment.pay_comment} Payment creation date: {payment.date_created}
ru: ДЛЯ АДМИНА: Уведомление о поступлении платежа id: {payment.id} Пользователь: {user.telegram_id} Сумма: {payment.amount} Комментарий к оплате: {payment.pay_comment} Дата создания платежа: {payment.date_created}

source: Accept
ru: Принять

source: Reject
ru: Отклонить

source: Payment accepted Amount: {payment.amount} Pay comment: {payment.pay_comment} Payment creation date: {payment.date_created}
ru: Оплата принята Сумма: {payment.amount} Комментарий к платежу: {payment.pay_comment} Дата создания платежа: {payment.date_created}

source: Payment information:
ru: Платежная информация:

source: *Crypto:*
ru: *Криптовалюта:*

source: *FPS Bank transfer:*
ru: *Банковский перевод СБП:*

source: Phone:
ru: Телефон:

source: Banks:
ru: Банки:

source: - Sber
ru: - Сбер

source: - Tinkoff
ru: - Тинькофф

source: User not registered
ru: Пользователь не найден

source: Pay with comment: {user.pay_comment} and use method: {user.payment_method} amount: {user.last_amount}
ru: Оплатить с помощью комментария: {user.pay_comment} и используйте метод: {user.payment_method} сумма: {user.last_amount}

source: Select payment method
ru: Выберите способ оплаты

source: Creating payment invoice: Enter pay comment (your name or any text to identify your payment) ex: Ivanov I.
ru: Создание счета на оплату: Введите комментарий к платежу (ваше имя или любой текст для идентификации вашего платежа) например: Иванов И.

source: Crypto
ru: Криптовалюта

source: FPS
ru: Банковский перевод СБП

source: Comment: {pay_comment}
ru: Комментарий: {pay_comment}

source: Enter pay comment or select from options
ru: Введите комментарий к оплате или выберите из предложенных вариантов

source: Amount: {amount}
ru: Сумма: {amount}

source: Amount: {user.last_amount}
ru: Сумма: {user.last_amount}

source: Enter amount to pay or select from options
ru: Введите сумму для оплаты или выберите один из вариантов

source: Amount must be integer
ru: Сумма должна быть целым числом

source: Confirm payment
ru: Подтвердить оплату

source: Create payment method: {pay_method} comment: {pay_comment} amount: {amount}
ru: Создайте платеж метод: {pay_method} комментарий: {pay_comment} сумма: {amount}

source: Payment creation canceled
ru: Создание платежа отменено

source: Payment accepted
ru: Платеж принят

source: Payment accepted: id: {payment.id} comment: {payment.pay_comment} method: {payment.payment_method} amount: {payment.amount} created: {payment.date_created} confirmed: {payment.date_confirmed}
ru: Оплата принята: id: {payment.id} комментарий: {payment.pay_comment} метод: {payment.payment_method} сумма: {payment.amount} создано: {payment.date_created} подтверждено: {payment.date_confirmed}

source: Comment set
ru: Комментарий принят

source: Comment set: {pay_comment}
ru: Комментарий принят: {pay_comment}

source: Amount set
ru: Сумма принята

source: Amount set: {amount}
ru: Сумма принята: {amount}

source: User not found, u can create a new one with /start
ru: Пользователь не найден, вы можете создать нового с помощью /start

source: Vpn config deleted
ru: Файл конфигурации Vpn удален

source: User deleted
ru: Пользователь удален

source: Please provide config user name
ru: Пожалуйста, укажите имя конфигурации VPN

source: User not found
ru: Пользователь не найден

source: VPN config removed
ru: Файл конфигурации VPN удален

source: Please provide config user name after command /add_config <user_name>
ru: Пожалуйста, укажите имя конфигурации VPN /add_config <имя_пользователя>

source: No configs found
ru: Конфигураций не найдено

source: Balance
ru: Баланс

source: Next payment
ru: Следующий платеж

source: Please provide code /redeem <code>
ru: Пожалуйста, укажите код /redeem <код>

source: Code redeemed
ru: Код погашен

source: Subscription activated
ru: Подписка активирована

source: Subscription deactivated
ru: Подписка деактивирована

source: Not enough balance
ru: Не достаточно средств
